@echo off
echo ==============================================
echo 🚀  Система подготовки к запуску CI/CD! 🚀
echo ==============================================
echo.
echo 🔍 Проверяем установленное ПО...
echo ----------------------------------------------
echo 🐳 Docker Version:
docker --version
echo ----------------------------------------------
echo 🦊 Git Version:
git --version
echo ----------------------------------------------
echo ☕ Java Version:
java -version
echo ----------------------------------------------
echo 🖥  Системная информация:
systeminfo | findstr /B /C:"OS Name" /C:"OS Version"
echo ==============================================
echo ✅  Проверка завершена! Готов к деплою!
